<?php

return [
    'age' => [
        '٢٠-٣٠',
        '٣٠-٤٠',
        '٤٠-٥٠',
        'أكبر من ٥٠',
    ],
    'group' => [
        'حكومي',
        'خاص'
    ],
    'bank' => [
        'الراجحي',
        'البلاد',
        'الرياض',
        'الأهلي',
        'الإنماء',
        'الجزيرة',
    ],
    'salary' => [
        'من ٠ إلى ٣٠٠٠',
        'من ٣٠٠٠ إلى ٥٩٩٩',
        'من ٦٠٠٠ إلى ٩٩٩٩',
        'من ١٠٠٠٠ إلى ١٩٩٩٩',
        'من ٢٠٠٠٠ إلى ٣٩٩٩٩',
        'من ٤٠٠٠٠ إلى ٧٩٩٩٩',
        'من ٨٠٠٠٠ و أكثر'
    ],
    'area' => [
        'المنطقة الوسطي',
        'المنطقة الشرقية',
        'المدينة والمنطقة الشمالية',
        'القصيم وحائل',
        'المنطقة الجنوبية',
        'المنطقة الغربية'
    ],
];
